In [115]:
import pickle
with open('./CycleRentUseMonth_2018.pkl', 'rb') as f:
	data = pickle.load(f)

In [134]:
data

          대여일자  대여소번호  이용건수
0      2018-01   1001   169
1      2018-01   1002    76
2      2018-01   1003    68
3      2018-01   1004   103
4      2018-01   1006    43
...        ...    ...   ...
15281  2018-12   3541   221
15282  2018-12   3542   138
15283  2018-12   9998    10
15284  2018-12  99998    86
15285  2018-12  99999   343

[15286 rows x 3 columns]

In [136]:
data[data.대여일자=="2018-01"]

         대여일자     대여소번호  이용건수
0     2018-01      1001   169
1     2018-01      1002    76
2     2018-01      1003    68
3     2018-01      1004   103
4     2018-01      1006    43
...       ...       ...   ...
1023  2018-01       932   133
1024  2018-01       933   150
1025  2018-01      9999   343
1026  2018-01  상암센터 정비실     1
1027  2018-01      중랑센터    44

[1028 rows x 3 columns]

In [1]:
import pymysql
con =pymysql.connect(host='ip', user='id', password='pw', db='encore6', charset='utf8')
cur = con.cursor()

In [127]:
# sql= """CREATE Table CycleRentUse
# (
#     `Rent_Date` CHAR(7),
#     `Rent_Number` INT,
#     `Rent_Count` INT
# )"""
# cur.execute(sql)
# con.commit()

In [118]:
insert_sql="INSERT INTO CycleRentUse VALUES (%s, %s, %s)"

In [70]:
# data1=data[(data['대여소번호'] == '상암센터 정비실')]

In [128]:
# data1

In [97]:
# data=data[~(data['대여소번호'] == '상암센터 정비실')]
import pandas as pd

In [98]:
# pd.set_option('display.max_rows', 10)

In [99]:
# data.loc[0,"대여소번호"]

In [100]:
# data.loc[i]

In [88]:
# cur.execute(insert_sql,data.loc[i].tolist())

1

In [119]:
# con.commit()
count=0

In [120]:
for i in range(len(data)):
    try:
        if int(data.loc[i,"대여소번호"]):
            cur.execute(insert_sql,data.loc[i].tolist())
    except:
        # print(data.loc[i,"대여소번호
        count+=1
        continue

In [121]:
con.commit()

In [122]:
print(count)

15

In [56]:
# list1 = data["대여소번호"].unique()

In [123]:
# data["대여소번호"].unique().value_count()

In [124]:
# data=data[~(data['대여소번호'] == '중랑센터')]

# 위트콤

In [125]:
# data

In [126]:
# data.apply(lambda x : cur.execute(insert_sql,x.tolist()),axis=1)

In [132]:
violation_accident = pd.read_sql_query("select * from violation_accident", con=con)

/tmp/ipykernel_13311/851296708.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  violation_accident = pd.read_sql_query("select * from violation_accident", con=con)

In [133]:
violation_accident.head(1)

,JIJACE_NM,CHISA,ACC_HUM,SIDO_CD,GUBUN_NM,SLTWD_CNT,SERI_ACC,SIDO_NM,AC_MODE,CRT_JIJACE_CD,...,TRK_CNT,DEATH_CNT,BASE_CODE,WND_CNT,DEATH_ACC,GUBUN,SERI_CNT,SLTWD_ACC,YEAR,BASE_CATEGORY
0,강남구,0.0,111,11000,승용,70,27,서울,A,11680,...,0,0,01,8,0,01,33,42,2018,위반

In [131]:
# customers
violation_accident_month = violation_accident.groupby(['대여일자',"대여소번호"],as_index=False)[['이용건수']].sum()